// Home Task 2
// 1. -- створити масив з:
// - з 5 числових значень
//     - з 5 стічкових значень
//         - з 5 значень стрічкового, числового та булевого типу
//             - та вивести його в консоль


// const fruits = ['1', '2', '3', '4', '5', `Banana`, `Apple`, `Lemon`, `Orange`];
// fruits.push('Hello', 'World', 'Are', 'You', 'Sleeping?');
// console.log(fruits.length)
// console.log(fruits);


// 2. -- Створити пустий масив.Наповнити його будь - якими значеннями звертаючись до конкретного індексу.Вивести в консоль


// const names = [];
// names[1] = 'Eddy'
// console.log(names);


// 3. - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

// let names = ['Ira', 'Eddy', 'Roma', 'Sasha', 'Valeria'];

// for (let i = 0; i < 10; i + 3) {
//     document.write('<div> It`s 2 lesson</div>');
//     i++
// }

// 4. - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

// const names = ['Rita', 'Ivan', 'Ira'];
// names.push = 'Eddy'

// for (let i = 0; i < 10; i + 3) {
//     document.write('<div>'[i] + [0] '</div>');
//     console.log([i])
//     i++
// }
// for (let i = 0; i < names.length; i = i++) {
//     console.log([i]);
//     i++
// }

// 5. - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

// let names = ['Dima', 'Ira', 'Olga', 'Ivan', 'Katya'];
// const SHOBLINNETAK = document.write('<h1> Ed </h1>');
// while (1 < names.length) {
//     document.write(`Hello dear ${names[0]} + ${names[1]}`)
//     i++;
// }


// 6. - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// 7 - Створити масив з 10 числових елементів.Вивести в консоль всі його елементи в циклі.

// 8 - Створити масив з 10 строкрових елементів.Вивести в консоль всі його елементи в циклі.

// 9 - Створити масив з 10 елементів будь - якого типу.Вивести в консоль всі його елементи в циклі.

// 10 - Створити масив з 10 елементів числового, стірчкового і булевого типу.За допомогою if та typeof вивести тільки булеві елементи

// 11 - Створити масив з 10 елементів числового, стірчкового і булевого типу.За допомогою if та typeof вивести тільки числові елементи

// 12 - Створити масив з 10 елементів числового, стрічкового і булевого типу.За допомогою if та typeof вивести тільки рядкові елементи


// 13 - Створити порожній масив.Наповнити його 10 елементами(різними за типами) через звернення до конкретних індексів.Вивести в консоль всі його елементи в циклі.

// 14 - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// 15 - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// 16 - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write

// 17 - Створити цикл for на 100 ітерацій.Вивести тільки парні кроки.через console.log + document.write

// 18 - Створити цикл for на 100 ітерацій.Вивести тільки парні кроки.через console.log + document.write

// 19 - Створити цикл for на 100 ітерацій.Вивести тільки непарні кроки.через console.log + document.write


// 20 - Гріши Задача

// let i = 0;
// while (i < 11) {
//     console.log(i)
//     i++;
// }
