 // 1. -  Створити функцію конструктор для об'єкту який описує теги/властивості
 //  -назва тегу
 //  - опис його дій
 //  - масив з атрибутами (2-3 атрибути максимум)

 //  Кожен атрибут описати як окремий який буде містити
 //  -назву атрибуту
 //  -опис дії атрибуту
 //  інформацію брати з htmlbook.ru

 function Tag(title, action, attrs) {
     this.test = title;
     this.test2 = action;
     this.test3 = attrs;
 }
 let title = '<a>';
 let action = 'Тег <a> является одним из важных элементов HTML и предназначен для создания ссылок.';

 let atributes = [
     { titleOfAttr: 'accesskey', actionOfAttr: `Активация ссылки с помощью комбинации клавиш.` },
     { titleOfAttr: 'coords', actionOfAttr: `Устанавливает координаты активной области.` },
     { titleOfAttr: 'download', actionOfAttr: `Предлагает скачать указанный по ссылке файл.` },
 ]

 let pushObject = new Tag(title, action, atributes);
 console.log(pushObject);

 let h1 = new Tag(
     '<h1>',
     'тег заголовку першого рівня', [{ titleOfAttr: 'class', actionOfAttr: 'клас це атрибут,який дозволяє робити вибірку елемента в css' }]
 );
 console.log(h1);
 //  - Таким чином описати теги
 //  -a
 //  -div
 //  -h1
 //  -span
 //  -input
 //  -form
 //  -option
 //  -select
 //  Приклад результату

 //    {
 //         titleOfTag  : 'area',
 //         action: `Каждый элемент <area> определяет активные области изображения, которые являются ссылками...`,
 //         attrs: [
 //         {titleOfAttr: 'accesskey', actionOfAttr: 'Переход к области с помощью комбинации клавиш'},
 //         {/*some props and values*/},
 //         {/*...*/},
 //         {/*...*/},
 //        
 //    }

 // ==============================================
 // 5 - Створити об'єкт car, з властивостями модель, виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:
 // -- drive () - яка виводить в консоль "їдемо зі швидкістю {максимальна швидкість} на годину"
 // -- info () - яка виводить всю інформацію про автомобіль
 // -- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed
 // -- changeYear (newValue) - змінює рік випуску на значення newValue
 // -- addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і доавляет його в поточний об'єкт car
 // ==============================================
 // CLASS

 // ==============================================
 // 6 - Створити функцію конструктор яка дозволяє створювати об'єкти car, з властивостями модель, виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:
 // -- drive () - яка виводить в консоль "їдемо зі швидкістю {максимальна швидкість} на годину"
 // -- info () - яка виводить всю інформацію про автомобіль
 // -- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed
 // -- changeYear (newValue) - змінює рік випуску на значення newValue
 // -- addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і доавляет його в поточний об'єкт car
 // ==============================================

 // ==============================================
 // 7 - Створити клас який дозволяє створювати об'єкти car, з властивостями модель, виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:
 // -- drive () - яка виводить в консоль "їдемо зі швидкістю {максимальна швидкість} на годину"
 // -- info () - яка виводить всю інформацію про автомобіль
 // -- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed
 // -- changeYear (newValue) - змінює рік випуску на значення newValue
 // -- addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і доавляет його в поточний об'єкт car
 // ==============================================


 // ==============================================
 // 8 - створити класс попелюшка з полями ім'я, вік, розмір ноги
 // --Створити 10 попелюшок , покласти їх в масив
 // --Сторити об'єкт класу "принц" за допомоги класу який має поля ім'я, вік, туфелька яку він знайшов.
 // -- за допоиоги циклу знайти яка попелюшка повинна бути з принцом
 // ==============================================



 // ==============================================
 // 9 - створити функцію конструктор попелюшка з полями ім'я, вік, розмір ноги
 // --Створити 10 попелюшок , покласти їх в масив
 // --Сторити об'єкт типу "принц" за допомоги функції конструктора з полями ім'я, вік, туфелька яку він знайшов, та функцію "пошук попелюшки"
 // -- функція повинна приймати масив попелюшок, та шукає ту котра йому підходить